[
  {
    "serviceId": 1,
    "serviceName": "Winter Coat Fitting for Dogs",
    "providerName": "PawCare Studio",
    "providerEmail": "info@pawcare.com",
    "price": 25,
    "rating": 4.9,
    "slotsAvailable": 4,
    "description": "Our premium custom winter coat fitting service is designed to provide the ultimate protection against freezing temperatures. We go beyond simple sizing by conducting a full body measurement to ensure a perfect ergonomic fit. Our collection includes high-performance, water-resistant, and windproof fabrics with thermal lining. Whether your dog is a small breed sensitive to the cold or a large breed needing extra chest protection, we guarantee a cozy fit that allows for maximum range of motion during outdoor adventures.",
    "image": "https://i.ibb.co.com/BHkk4YZD/alvan-nee-br-Fs-Z7qsz-SY-unsplash.jpg",
    "category": "Clothing"
  },
  {
    "serviceId": 2,
    "serviceName": "Winter Grooming & Paw Treatment",
    "providerName": "CozyPets Grooming",
    "providerEmail": "hello@cozypets.com",
    "price": 30,
    "rating": 4.8,
    "slotsAvailable": 3,
    "description": "The winter season can be incredibly harsh on a pet's skin and paws due to dry air and icy pavements. Our specialized Winter Grooming & Paw Treatment includes a deep-moisturizing bath with oatmeal-based, pH-balanced shampoos to prevent itchy, flaky skin. We follow this with a therapeutic paw balm application that creates a breathable, protective barrier against snow, ice, and chemical de-icers. We also trim the hair between the paw pads to prevent ice balls from forming, ensuring your pet walks comfortably all season long.",
    "image": "https://i.ibb.co.com/VRqt4Vr/alvan-nee-T-0-EW-SEbs-E-unsplash.jpg",
    "category": "Grooming"
  },
  {
    "serviceId": 3,
    "serviceName": "Heated Pet Bed",
    "providerName": "WarmTail Supplies",
    "providerEmail": "support@warmtail.com",
    "price": 40,
    "rating": 4.7,
    "slotsAvailable": 6,
    "description": "Give your furry companion the luxury of a warm retreat with our state-of-the-art heated pet beds. These beds are engineered with dual-thermostat technology to maintain a consistent, vet-recommended temperature that mirrors a pet's natural body heat. Made with orthopedic memory foam and soft, removable faux-fur covers, these beds are particularly beneficial for pets with joint pain or thin coats. The energy-efficient heating element is safely tucked away, providing a secure and tranquil environment for deep sleep during the coldest winter nights.",
    "image": "https://i.ibb.co.com/m5cP9PkM/baptist-standaert-mx0-DEnf-Yxic-unsplash.jpg",
    "category": "Accessories"
  },
  {
    "serviceId": 4,
    "serviceName": "Winter Health Checkup",
    "providerName": "Happy Paws Vet Clinic",
    "providerEmail": "vet@happypaws.com",
    "price": 35,
    "rating": 4.9,
    "slotsAvailable": 2,
    "description": "Cold weather can exacerbate underlying health issues in pets, which is why our Winter Health Checkup is essential. This comprehensive medical evaluation focuses on immunity boosting, respiratory health, and a specialized musculoskeletal exam to check for cold-induced arthritis or stiffness. Our experienced veterinarians also evaluate your pet's body condition score to determine if they have enough insulating fat for the season. We provide personalized recommendations on vitamins and preventative care to ensure your pet stays robust and healthy despite the drop in temperature.",
    "image": "https://i.ibb.co.com/yF68F4pC/oscar-sutton-yihla-RCCvd4-unsplash.jpg",
    "category": "Health Care"
  },
  {
    "serviceId": 5,
    "serviceName": "Pet Winter Nutrition Plan",
    "providerName": "NutriPet Care",
    "providerEmail": "nutrition@nutripet.com",
    "price": 20,
    "rating": 4.6,
    "slotsAvailable": 7,
    "description": "A pet's metabolic needs change significantly when the mercury drops. Our Pet Winter Nutrition Plan offers a deep dive into your pet’s dietary requirements to help them maintain an ideal body temperature and high energy levels. We analyze their current diet and provide a customized roadmap that may include increased healthy fats for coat insulation and antioxidants to support the immune system. This service is perfect for active dogs who spend time outdoors or senior pets who need a more digestible, nutrient-dense diet during the winter months.",
    "image": "https://i.ibb.co.com/FbdDRt0s/celine-sayuri-tagami-2s6-ORa-JY6g-I-unsplash.jpg",
    "category": "Nutrition"
  },
  {
    "serviceId": 6,
    "serviceName": "Indoor Play & Exercise Session",
    "providerName": "ActivePaws Center",
    "providerEmail": "play@activepaws.com",
    "price": 18,
    "rating": 4.5,
    "slotsAvailable": 8,
    "description": "When it's too cold or snowy for a long walk, our Indoor Play & Exercise Sessions provide the perfect outlet for your pet's pent-up energy. Our facility features a large, climate-controlled arena equipped with agility tunnels, soft-play obstacles, and interactive puzzle games. Each session is supervised by professional trainers who facilitate structured play to improve cardiovascular health and mental sharpness. It’s an excellent way for your pet to socialize with others in a safe, warm, and dry environment, preventing the winter blues and weight gain.",
    "image": "https://i.ibb.co.com/Tqp3YrNP/charlesdeluvio-K4m-SJ7kc0-As-unsplash-1.jpg",
    "category": "Training"
  },
  {
    "serviceId": 7,
    "serviceName": "Winter Jacket for Cats",
    "providerName": "CatCozy Wear",
    "providerEmail": "support@catcozy.com",
    "price": 22,
    "rating": 4.6,
    "slotsAvailable": 5,
    "description": "Cats are notoriously sensitive to cold, and our Winter Jacket for Cats is the ideal solution for keeping them snug. These jackets are uniquely patterned to accommodate a cat's flexible spine and jumping movements without causing distress. Using ultra-lightweight, breathable insulation, these garments provide a significant boost in core warmth. They feature easy-secure fasteners that won't snag on fur and are available in various styles, from quilted vests to fleece-lined hoodies, ensuring your indoor or outdoor feline stays warm and stress-free.",
    "image": "https://i.ibb.co.com/chrvc0Xt/charlesdeluvio-Mv9hjn-EUHR4-unsplash.jpg",
    "category": "Clothing"
  },
  {
    "serviceId": 8,
    "serviceName": "Senior Pet Winter Care",
    "providerName": "Golden Paws Care",
    "providerEmail": "care@goldenpaws.com",
    "price": 45,
    "rating": 4.9,
    "slotsAvailable": 3,
    "description": "The golden years require extra attention, especially during winter when cold can cause significant discomfort in aging joints. Our Senior Pet Winter Care is a holistic service that includes gentle heat therapy, low-impact stretching to improve mobility, and a customized home comfort assessment. We provide advice on slip-proofing your home and optimizing your pet's sleeping area for warmth. Our goal is to enhance the quality of life for your senior companion, ensuring they remain comfortable, mobile, and happy throughout the harshest winter weather.",
    "image": "https://i.ibb.co.com/rR2t2921/joe-caione-q-O-PIF84-Vxg-unsplash.jpg",
    "category": "Health Care"
  },
  {
    "serviceId": 9,
    "serviceName": "Pet Sweater Knitting",
    "providerName": "Handmade Paws",
    "providerEmail": "knit@handmadepaws.com",
    "price": 28,
    "rating": 4.7,
    "slotsAvailable": 4,
    "description": "Wrap your pet in the warmth of a bespoke, hand-knitted sweater. Our artisans use only the finest natural fibers, such as organic cotton and hypoallergenic wool blends, to ensure the garment is as comfortable as it is beautiful. Every sweater is custom-made to your pet's specific dimensions, featuring reinforced stitching and flexible necklines for ease of wear. Beyond just fashion, these sweaters provide an essential layer of insulation for short-haired breeds, making them a perfect blend of artisanal craftsmanship and practical winter utility.",
    "image": "https://i.ibb.co.com/TDq42c3g/milli-2l0-CWTpc-Ch-I-unsplash.jpg",
    "category": "Clothing"
  },
  {
    "serviceId": 10,
    "serviceName": "Winter Bath & Spa",
    "providerName": "Luxury Paws Spa",
    "providerEmail": "spa@luxurypaws.com",
    "price": 50,
    "rating": 4.8,
    "slotsAvailable": 2,
    "description": "Indulge your pet with our exclusive Winter Bath & Spa experience, designed to combat the drying effects of indoor heating. This premium service begins with a warm-water hydro-massage to relax tight muscles and improve lymphatic drainage. We use specialized silk-protein conditioners to restore luster to dull winter coats and finish with a gentle blow-dry and brush-out. Your pet will also enjoy a lavender-infused aromatherapy session, leaving them feeling refreshed, smelling wonderful, and completely pampered in a serene, heated spa environment.",
    "image": "https://i.ibb.co.com/yF68F4pC/oscar-sutton-yihla-RCCvd4-unsplash.jpg",
    "category": "Grooming"
  },
  {
    "serviceId": 11,
    "serviceName": "Dog Boot Fitting",
    "providerName": "SnowStep Pets",
    "providerEmail": "boots@snowstep.com",
    "price": 15,
    "rating": 4.4,
    "slotsAvailable": 10,
    "description": "Paw protection is vital when walking on salted roads and frozen ground. Our Dog Boot Fitting service ensures that your pet gets a secure, non-slip fit that won't fall off during a run. We offer a variety of styles, including waterproof shells for slushy days and fleece-lined boots for extreme cold. Our experts will train your dog to get used to the sensation of wearing boots, providing a stress-free transition. These boots are essential for preventing chemical burns from salt and protecting sensitive paws from sharp ice shards and frostbite.",
    "image": "https://i.ibb.co.com/93GrXgSY/peri-stojnic-5-Vr-RVPfb-MI-unsplash.jpg",
    "category": "Accessories"
  },
  {
    "serviceId": 12,
    "serviceName": "Pet Cold Allergy Consultation",
    "providerName": "VetHelp Online",
    "providerEmail": "help@vethelp.com",
    "price": 27,
    "rating": 4.6,
    "slotsAvailable": 6,
    "description": "Many pet owners are unaware that pets can suffer from environmental allergies triggered specifically by winter conditions, such as mold from damp coats or sensitivity to indoor dust. Our online consultation connects you with veterinary experts who specialize in allergy management. We provide a detailed analysis of your pet’s symptoms, help identify potential triggers in your home, and offer a comprehensive management plan. This includes recommendations for air purification, topical treatments, and diet changes to keep your pet’s skin and respiratory system healthy.",
    "image": "https://i.ibb.co.com/v4Js7Yyr/ralu-gal-G8c-B8h-Y3yv-U-unsplash.jpg",
    "category": "Health Care"
  },
  {
    "serviceId": 13,
    "serviceName": "Puppy Winter Training",
    "providerName": "SmartPup School",
    "providerEmail": "train@smartpup.com",
    "price": 32,
    "rating": 4.7,
    "slotsAvailable": 5,
    "description": "Training a puppy in the winter presents unique hurdles, from housebreaking in the snow to maintaining focus in the cold. Our specialized Puppy Winter Training program uses positive reinforcement to teach your pup how to navigate winter environments with confidence. We focus on 'paws-on-the-ground' manners for icy walks, recall in distracting snowy conditions, and indoor mental stimulation techniques. This course ensures that your puppy's development doesn't stall during the winter months, setting them up for a lifetime of good behavior and adaptability.",
    "image": "https://i.postimg.cc/qvR6zXvY/puppy-training.jpg",
    "category": "Training"
  },
  {
    "serviceId": 14,
    "serviceName": "Pet Blanket & Bedding Set",
    "providerName": "CozyNest Pets",
    "providerEmail": "sales@cozynest.com",
    "price": 26,
    "rating": 4.5,
    "slotsAvailable": 9,
    "description": "Create a warm sanctuary for your pet with our high-quality Winter Blanket & Bedding Set. Each set includes a double-layered, ultra-soft fleece blanket and a self-warming pet mat that uses reflective technology to trap and return your pet's own body heat. These materials are chosen for their durability, softness, and ease of cleaning. Whether used as an upgrade to their existing bed or as a cozy layer for travel crates, our bedding sets ensure that your pet has a plush, insulated place to burrow into, no matter how low the outside temperature drops.",
    "image": "https://i.ibb.co.com/FbdDRt0s/celine-sayuri-tagami-2s6-ORa-JY6g-I-unsplash.jpg",
    "category": "Accessories"
  },
  {
    "serviceId": 15,
    "serviceName": "Winter Dental Care",
    "providerName": "BrightSmile Pets",
    "providerEmail": "care@brightsmile.com",
    "price": 29,
    "rating": 4.6,
    "slotsAvailable": 4,
    "description": "Oral health is often overlooked in the winter, but cold air can cause significant discomfort for pets with sensitive gums or dental decay. Our Winter Dental Care service includes a comprehensive oral exam, professional scaling to remove tartar buildup, and a soothing gum treatment to reduce inflammation. We also provide a customized winter dental hygiene kit and advice on water additives that prevent bacteria growth. By maintaining your pet’s dental health now, you can prevent more serious systemic health issues and ensure they can eat comfortably throughout the season.",
    "image": "https://i.ibb.co.com/zTDy10wy/richard-brutyo-Sg3-Xwu-Epyb-U-unsplash.jpg",
    "category": "Health Care"
  },
  {
    "serviceId": 16,
    "serviceName": "Cat Indoor Play Zone",
    "providerName": "WhiskerWorld",
    "providerEmail": "play@whiskerworld.com",
    "price": 17,
    "rating": 4.4,
    "slotsAvailable": 8,
    "description": "Keep your cat active and entertained with a visit to our specialized Cat Indoor Play Zone. This feline-only environment features multi-level climbing walls, heated cat trees, and automated laser systems designed to trigger their natural hunting instincts. The zone is kept at a perfect, cozy temperature, providing a much-needed change of scenery for indoor cats who may become lethargic in the winter. Our staff ensures a safe, quiet atmosphere where your cat can explore, pounce, and play to their heart's content, maintaining both their physical fitness and mental well-being.",
    "image": "https://i.ibb.co.com/B2Dzqg3m/victor-g-N04-FIf-Hhv-k-unsplash-1.jpg",
    "category": "Training"
  },
  {
    "serviceId": 17,
    "serviceName": "Emergency Winter Pet Care",
    "providerName": "24/7 Pet Rescue",
    "providerEmail": "emergency@petrescue.com",
    "price": 60,
    "rating": 4.9,
    "slotsAvailable": 1,
    "description": "Our Emergency Winter Pet Care is a lifeline for pets facing critical weather-related health crises. We are equipped to handle urgent cases such as severe hypothermia, frostbite on extremities, and injuries resulting from falls on ice. Our emergency facility features high-tech warming blankets, IV fluid warmers, and oxygen therapy to stabilize pets in shock. With a dedicated team of emergency vets on standby 24/7, we provide immediate, expert intervention when every second counts, ensuring your pet has the best possible chance of recovery during extreme winter events.",
    "image": "https://i.ibb.co.com/v4Js7Yyr/ralu-gal-G8c-B8h-Y3yv-U-unsplash.jpg",
    "category": "Health Care"
  },
  {
    "serviceId": 18,
    "serviceName": "Pet Scarf & Hat Set",
    "providerName": "CutePaws Fashion",
    "providerEmail": "fashion@cutepaws.com",
    "price": 19,
    "rating": 4.3,
    "slotsAvailable": 7,
    "description": "Add an extra layer of warmth and a touch of seasonal flair with our designer Scarf & Hat Sets for pets. These accessories are meticulously crafted from soft, stretchy knits that fit snugly without being restrictive. The hats are designed with ear-holes for maximum comfort, protecting sensitive ear tips from frostnip, while the scarves offer added insulation for the neck and chest area. Perfect for holiday photoshoots or brisk morning walks, these sets ensure your pet looks adorable while staying protected from the biting winter wind.",
    "image": "https://i.ibb.co.com/yF68F4pC/oscar-sutton-yihla-RCCvd4-unsplash.jpg",
    "category": "Clothing"
  },
  {
    "serviceId": 19,
    "serviceName": "Winter Hydration Monitoring",
    "providerName": "PetWell Tracker",
    "providerEmail": "track@petwell.com",
    "price": 23,
    "rating": 4.5,
    "slotsAvailable": 6,
    "description": "Proper hydration is just as important in the winter as it is in the summer, yet many pets drink less when the water is cold. Our Winter Hydration Monitoring service uses advanced tracking tools to analyze your pet’s drinking patterns and ensure they aren't suffering from the dehydrating effects of dry indoor heat. We provide recommendations on heated water bowls to prevent freezing and suggest specialized hydration-boosting wet food transitions. This proactive approach helps maintain kidney function, keeps skin healthy, and ensures your pet’s body can efficiently regulate its temperature.",
    "image": "https://i.ibb.co.com/v4Js7Yyr/ralu-gal-G8c-B8h-Y3yv-U-unsplash.jpg",
    "category": "Health Care"
  },
  {
    "serviceId": 20,
    "serviceName": "Pet Massage Therapy",
    "providerName": "RelaxPaws Therapy",
    "providerEmail": "therapy@relaxpaws.com",
    "price": 34,
    "rating": 4.8,
    "slotsAvailable": 3,
    "description": "Our specialized Pet Massage Therapy is the perfect antidote to the physical stress of winter. Using a combination of Swedish and deep-tissue techniques adapted for animals, our certified therapists work to release muscle knots, improve circulation, and enhance joint lubrication. This therapy is especially effective for pets who experience increased stiffness or 'winter lethargy' due to reduced activity. Each session takes place in a warm, quiet room with soothing music, providing a deeply relaxing experience that boosts your pet’s mobility and overall sense of happiness.",
    "image": "https://i.ibb.co.com/B2Dzqg3m/victor-g-N04-FIf-Hhv-k-unsplash-1.jpg",
    "category": "Wellness"
  }
]